app/views/games/_genres.html.erb

    <h1><%= genre.name %> </h1>
    <% genre.games.each do |game| %>
---
SELECT "games".* FROM "games" INNER JOIN "games_genres" ON "games"."id" = "games_genres"."game_id" WHERE "games_genres"."genre_id" = $1  [["genre_id", 1]]