app/views/games/index.html.erb


    <%= select_tag :genre, options_from_collection_for_select(
      @genres.to_a.unshift(Genre.new(id: 0, name: "All")),
      "name",
      "name",
      "0" ) %>
---
SELECT "genres".* FROM "genres"