app/views/games/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "games_genres" ON "genres"."id" = "games_genres"."genre_id" WHERE "games_genres"."game_id" = $1  [["game_id", 3]]
SELECT COUNT(*) FROM "genres" INNER JOIN "games_genres" ON "genres"."id" = "games_genres"."genre_id" WHERE "games_genres"."game_id" = $1  [["game_id", 3]]
---

<h3> this game belongs to <%= pluralize(@game.genres.count, "genre") %></h3>
<% @game.genres.each do |genre|%>