app/controllers/games_controller.rb

INSERT INTO "games" ("title", "review", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Skyrim"], ["review", "not as a good As mirzapur"], ["rating", "8.5"], ["created_at", "2021-09-07 06:42:59.568483"], ["updated_at", "2021-09-07 06:42:59.568483"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

SELECT "games".* FROM "games"
---
    def set_games_and_genre_with_criteria(requested_genre, requested_order)
      if requested_genre.nil? || requested_genre.eql?('All')
        games_by_genre = Game.all